; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Freecell is a solitaire game that comes with Windows.
;;; If you haven't seen it before:
;;;  One has 8 columns of cards, 4 freecells and 4 homecells. The
;;;  cards start in "random" (random according to MS's brain damaged RNG)
;;;  piles in the 8 columns. We can move a card in the following ways: 
;;;  1. we can move any card that is on top of a column to an empty free
;;;     cell. The free cells only take one card each.
;;;  2. we can move any card from a free cell or from top of a column to
;;;  a home cell if that home cell contains a card of the same suit
;;;  and is one lower in value (aces have value 1, Jacks 11, Queens
;;;  12, Kings 13), and to make things more symmetric we start the
;;;  homecells off containing "phone" cards with value 0.
;;;  3. we can move any card from the  top of a column or from a
;;;  freecell to the top of another column if that column currently holds
;;;  a card with an opposite colour suit that has one higher
;;;  value. 
;;;  4. we can move any card from a free cell or on top of a column to a
;;;  new column if there are less than 8 columns.
;;; The aim is to get all of the card home. The problems show quite a
;;; good variety of difficulty. 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain freecell)
  (:requirements :strips :typing)
  (:types card colnum cellnum num suit)
  (:predicates (on ?c1 - card ?c2 - card)
	       (incell ?c - card)
	       (clear ?c - card)
	       (cellspace ?n - cellnum)
	       (colspace ?n - colnum)
	       (home ?c - card)
	       (bottomcol ?c - card)
	       (canstack ?c1 - card ?c2 - card)
	       (hassuit ?c - card ?s - suit)
	       (value ?c - card ?v - num)
	       (successor ?n1 - num ?n0 - num)
	       (colsuccessor ?n1 - colnum ?n0 - colnum)
	       (cellsuccessor ?n1 - cellnum ?n0 - cellnum)
 )

;;; Move card between columns. Two versions dependent on whether or
;;; not we generate a new stack.

  (:action move
	   :parameters (?card ?oldcard ?newcard - card)
	   :precondition (and (clear ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (on ?card ?oldcard))
	   :effect (and
		    (on ?card ?newcard)
		    (clear ?oldcard)
		    (not (on ?card ?oldcard))
		    (not (clear ?newcard))))

  (:action move-b
	   :parameters (?card ?newcard - card ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and (on ?card ?newcard)
			(colspace ?ncols)
			(not (bottomcol ?card))
			(not (clear ?newcard))
			(not (colspace ?cols))))

;; Send a card to a freecell. Two versions dependent on whether or not
;; we generate a new stack.

  (:action sendtofree
	   :parameters (?card ?oldcard - card ?cells ?ncells - cellnum)
	   :precondition (and
			  (clear ?card)
			  (on ?card ?oldcard)
			  (cellspace ?cells)
			  (cellsuccessor ?cells ?ncells))
	   :effect (and
		    (incell ?card)
		    (clear ?oldcard)
		    (cellspace ?ncells)
		    (not (on ?card ?oldcard))
		    (not (clear ?card))
		    (not (cellspace ?cells))))

  (:action sendtofree-b
	   :parameters (?card - card ?cells ?ncells - cellnum ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (cellspace ?cells)
			      (cellsuccessor ?cells ?ncells)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and
		    (incell ?card)
		    (colspace ?ncols)
		    (cellspace ?ncells)
		    (not (bottomcol ?card))
		    (not (clear ?card))
		    (not (colspace ?cols))
		    (not (cellspace ?cells))))

;; Send a card a new column

(:action sendtonewcol
	 :parameters (?card ?oldcard - card ?cols ?ncols - colnum)
	 :precondition (and
			(clear ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(on ?card ?oldcard))
	 :effect (and
		  (bottomcol ?card)
		  (clear ?oldcard)
		  (colspace ?ncols)
		  (not (on ?card ?oldcard))
		  (not (colspace ?cols))))

;;Send a card home

(:action sendtohome
	 :parameters (?card ?oldcard - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num)
	 :precondition (and
			(clear ?card)
			(on ?card ?oldcard)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
	 :effect (and (home ?card)
		      (clear ?oldcard)
		      (not (on ?card ?oldcard))
                      (not (home ?homecard))
		      (not (clear ?card))))

(:action sendtohome-b
	 :parameters (?card - card ?suitname - suit  ?vcard - num
			    ?homecard - card
			    ?vhomecard - num
			    ?cols ?ncols - colnum)
	 :precondition (and (clear ?card)
			    (bottomcol ?card)
			    (home ?homecard)
			    (hassuit ?card ?suitname)
			    (hassuit ?homecard ?suitname)
			    (value ?card ?vcard)
			    (value ?homecard ?vhomecard)
			    (successor ?vcard ?vhomecard)
			    (colspace ?cols)
			    (colsuccessor ?ncols ?cols))
	 :effect (and (home ?card)
		      (colspace ?ncols)
		      (not (home ?homecard))
		      (not (clear ?card))
		      (not (bottomcol ?card))
		      (not (colspace ?cols))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Move cards in free cell
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:action homefromfreecell
	 :parameters (?card - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num
			    ?cells ?ncells - cellnum)
    ;;Send a card home from a free cell.
	 :precondition (and
			(incell ?card)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard)
			(cellspace ?cells)
			(cellsuccessor ?ncells ?cells))
	 :effect (and
		  (home ?card)
		  (cellspace ?ncells)
		  (not (incell ?card))
		  (not (cellspace ?cells))
		  (not (home ?homecard))))

(:action colfromfreecell
	 :parameters (?card ?newcard -  card ?cells ?ncells - cellnum)
	 :precondition (and  (incell ?card)
			     (clear ?newcard)
			     (canstack ?card ?newcard)
			     (cellspace ?cells)
			     (cellsuccessor ?ncells ?cells))
	 :effect (and (cellspace ?ncells)
		      (clear ?card)
		      (on ?card ?newcard)
		      (not (incell ?card))
		      (not (cellspace ?cells))
		      (not (clear ?newcard))))

(:action newcolfromfreecell
	 :parameters (?card - card ?cols ?ncols - colnum ?cells ?ncells - cellnum)
	 :precondition (and (incell ?card)
			    (colspace ?cols)
			    (cellspace ?cells)
			    (colsuccessor ?cols ?ncols)
			    (cellsuccessor ?ncells ?cells))
	 :effect (and (bottomcol ?card)
		      (clear ?card)
		      (colspace ?ncols)
		      (cellspace ?ncells)
		      (not (incell ?card))
		      (not (colspace ?cols))
		      (not (cellspace ?cells)))))

; problem
(define (problem freecell-f22-c8-s4-i8-g2-r2027-011-111-211-311
)(:domain freecell)
(:objects 
          c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11
          h0 h1 h2 h3 h4 h5 h6 h7 h8 h9 h10 h11
          s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10 s11
          d0 d1 d2 d3 d4 d5 d6 d7 d8 d9 d10 d11
 - card
          celln0 celln1 celln2 celln3 celln4 celln5 celln6 celln7 celln8 celln9 celln10 celln11 celln12 celln13 celln14 celln15 celln16 celln17 celln18 celln19 celln20 celln21 celln22 
 - cellnum
          coln0 coln1 coln2 coln3 coln4 coln5 coln6 coln7 coln8 
 - colnum
          n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 n11 
 - num
           c h s d
 - suit
)
(:init
(value c0 n0)
(value c1 n1)
(value c2 n2)
(value c3 n3)
(value c4 n4)
(value c5 n5)
(value c6 n6)
(value c7 n7)
(value c8 n8)
(value c9 n9)
(value c10 n10)
(value c11 n11)
(value h0 n0)
(value h1 n1)
(value h2 n2)
(value h3 n3)
(value h4 n4)
(value h5 n5)
(value h6 n6)
(value h7 n7)
(value h8 n8)
(value h9 n9)
(value h10 n10)
(value h11 n11)
(value s0 n0)
(value s1 n1)
(value s2 n2)
(value s3 n3)
(value s4 n4)
(value s5 n5)
(value s6 n6)
(value s7 n7)
(value s8 n8)
(value s9 n9)
(value s10 n10)
(value s11 n11)
(value d0 n0)
(value d1 n1)
(value d2 n2)
(value d3 n3)
(value d4 n4)
(value d5 n5)
(value d6 n6)
(value d7 n7)
(value d8 n8)
(value d9 n9)
(value d10 n10)
(value d11 n11)
(cellsuccessor celln1 celln0)
(cellsuccessor celln2 celln1)
(cellsuccessor celln3 celln2)
(cellsuccessor celln4 celln3)
(cellsuccessor celln5 celln4)
(cellsuccessor celln6 celln5)
(cellsuccessor celln7 celln6)
(cellsuccessor celln8 celln7)
(cellsuccessor celln9 celln8)
(cellsuccessor celln10 celln9)
(cellsuccessor celln11 celln10)
(cellsuccessor celln12 celln11)
(cellsuccessor celln13 celln12)
(cellsuccessor celln14 celln13)
(cellsuccessor celln15 celln14)
(cellsuccessor celln16 celln15)
(cellsuccessor celln17 celln16)
(cellsuccessor celln18 celln17)
(cellsuccessor celln19 celln18)
(cellsuccessor celln20 celln19)
(cellsuccessor celln21 celln20)
(cellsuccessor celln22 celln21)
(colsuccessor coln1 coln0)
(colsuccessor coln2 coln1)
(colsuccessor coln3 coln2)
(colsuccessor coln4 coln3)
(colsuccessor coln5 coln4)
(colsuccessor coln6 coln5)
(colsuccessor coln7 coln6)
(colsuccessor coln8 coln7)
(successor n1 n0)
(successor n2 n1)
(successor n3 n2)
(successor n4 n3)
(successor n5 n4)
(successor n6 n5)
(successor n7 n6)
(successor n8 n7)
(successor n9 n8)
(successor n10 n9)
(successor n11 n10)
(hassuit c0 c)
(hassuit c1 c)
(hassuit c2 c)
(hassuit c3 c)
(hassuit c4 c)
(hassuit c5 c)
(hassuit c6 c)
(hassuit c7 c)
(hassuit c8 c)
(hassuit c9 c)
(hassuit c10 c)
(hassuit c11 c)
(hassuit h0 h)
(hassuit h1 h)
(hassuit h2 h)
(hassuit h3 h)
(hassuit h4 h)
(hassuit h5 h)
(hassuit h6 h)
(hassuit h7 h)
(hassuit h8 h)
(hassuit h9 h)
(hassuit h10 h)
(hassuit h11 h)
(hassuit s0 s)
(hassuit s1 s)
(hassuit s2 s)
(hassuit s3 s)
(hassuit s4 s)
(hassuit s5 s)
(hassuit s6 s)
(hassuit s7 s)
(hassuit s8 s)
(hassuit s9 s)
(hassuit s10 s)
(hassuit s11 s)
(hassuit d0 d)
(hassuit d1 d)
(hassuit d2 d)
(hassuit d3 d)
(hassuit d4 d)
(hassuit d5 d)
(hassuit d6 d)
(hassuit d7 d)
(hassuit d8 d)
(hassuit d9 d)
(hassuit d10 d)
(hassuit d11 d)
(canstack c2 h3)
(canstack c2 d3)
(canstack c3 h4)
(canstack c3 d4)
(canstack c4 h5)
(canstack c4 d5)
(canstack c5 h6)
(canstack c5 d6)
(canstack c6 h7)
(canstack c6 d7)
(canstack c7 h8)
(canstack c7 d8)
(canstack c8 h9)
(canstack c8 d9)
(canstack c9 h10)
(canstack c9 d10)
(canstack c10 h11)
(canstack c10 d11)
(canstack h2 c3)
(canstack h2 s3)
(canstack h3 c4)
(canstack h3 s4)
(canstack h4 c5)
(canstack h4 s5)
(canstack h5 c6)
(canstack h5 s6)
(canstack h6 c7)
(canstack h6 s7)
(canstack h7 c8)
(canstack h7 s8)
(canstack h8 c9)
(canstack h8 s9)
(canstack h9 c10)
(canstack h9 s10)
(canstack h10 c11)
(canstack h10 s11)
(canstack s2 h3)
(canstack s2 d3)
(canstack s3 h4)
(canstack s3 d4)
(canstack s4 h5)
(canstack s4 d5)
(canstack s5 h6)
(canstack s5 d6)
(canstack s6 h7)
(canstack s6 d7)
(canstack s7 h8)
(canstack s7 d8)
(canstack s8 h9)
(canstack s8 d9)
(canstack s9 h10)
(canstack s9 d10)
(canstack s10 h11)
(canstack s10 d11)
(canstack d2 c3)
(canstack d2 s3)
(canstack d3 c4)
(canstack d3 s4)
(canstack d4 c5)
(canstack d4 s5)
(canstack d5 c6)
(canstack d5 s6)
(canstack d6 c7)
(canstack d6 s7)
(canstack d7 c8)
(canstack d7 s8)
(canstack d8 c9)
(canstack d8 s9)
(canstack d9 c10)
(canstack d9 s10)
(canstack d10 c11)
(canstack d10 s11)
(home c0)
(home h0)
(home s0)
(home d0)
(cellspace celln22)
(colspace coln0)

(bottomcol s7)
(on d10 s7)
(on c5 d10)
(on d6 c5)
(on d3 d6)
(clear d3)

(bottomcol c10)
(on d9 c10)
(on s4 d9)
(on h2 s4)
(on s6 h2)
(on h10 s6)
(on h11 h10)
(on s1 h11)
(on h8 s1)
(clear h8)

(bottomcol c4)
(on d1 c4)
(on h5 d1)
(on d4 h5)
(on c9 d4)
(on d5 c9)
(clear d5)

(bottomcol c8)
(on c11 c8)
(on c6 c11)
(on c1 c6)
(on s8 c1)
(on s10 s8)
(clear s10)

(bottomcol c2)
(on d7 c2)
(on c3 d7)
(on s11 c3)
(on h9 s11)
(on h1 h9)
(clear h1)

(bottomcol d2)
(on h3 d2)
(clear h3)

(bottomcol c7)
(on d11 c7)
(on h4 d11)
(clear h4)

(bottomcol h6)
(on d8 h6)
(on s9 d8)
(on s3 s9)
(on h7 s3)
(on s2 h7)
(on s5 s2)
(clear s5)
)
(:goal
(and
(home c2)
(home h2)
(home s2)
(home d2)
)
)
)

; plan
1. (sendtohome h1 h9 h n1 h0 n0)
   deleted: (on h1 h9) (home h0) (clear h1)
   added: (home h1) (clear h9)
   goals met: 0 of 4
2. (sendtofree h8 s1 celln22 celln21)
   deleted: (on h8 s1) (clear h8) (cellspace celln22)
   added: (incell h8) (clear s1) (cellspace celln21)
   goals met: 0 of 4
3. (sendtohome s1 h11 s n1 s0 n0)
   deleted: (on s1 h11) (home s0) (clear s1)
   added: (home s1) (clear h11)
   goals met: 0 of 4
4. (sendtofree h11 h10 celln21 celln20)
   deleted: (on h11 h10) (clear h11) (cellspace celln21)
   added: (incell h11) (clear h10) (cellspace celln20)
   goals met: 0 of 4
5. (sendtofree s10 s8 celln20 celln19)
   deleted: (on s10 s8) (clear s10) (cellspace celln20)
   added: (incell s10) (clear s8) (cellspace celln19)
   goals met: 0 of 4
6. (move s8 c1 h9)
   deleted: (on s8 c1) (clear h9)
   added: (on s8 h9) (clear c1)
   goals met: 0 of 4
7. (sendtohome c1 c6 c n1 c0 n0)
   deleted: (on c1 c6) (home c0) (clear c1)
   added: (home c1) (clear c6)
   goals met: 0 of 4
8. (sendtofree h10 s6 celln19 celln18)
   deleted: (on h10 s6) (clear h10) (cellspace celln19)
   added: (incell h10) (clear s6) (cellspace celln18)
   goals met: 0 of 4
9. (sendtofree s8 h9 celln18 celln17)
   deleted: (on s8 h9) (clear s8) (cellspace celln18)
   added: (incell s8) (clear h9) (cellspace celln17)
   goals met: 0 of 4
10. (sendtofree h9 s11 celln17 celln16)
   deleted: (on h9 s11) (clear h9) (cellspace celln17)
   added: (incell h9) (clear s11) (cellspace celln16)
   goals met: 0 of 4
11. (sendtofree s11 c3 celln16 celln15)
   deleted: (on s11 c3) (clear s11) (cellspace celln16)
   added: (incell s11) (clear c3) (cellspace celln15)
   goals met: 0 of 4
12. (move d5 c9 c6)
   deleted: (on d5 c9) (clear c6)
   added: (on d5 c6) (clear c9)
   goals met: 0 of 4
13. (sendtofree c9 d4 celln15 celln14)
   deleted: (on c9 d4) (clear c9) (cellspace celln15)
   added: (incell c9) (clear d4) (cellspace celln14)
   goals met: 0 of 4
14. (sendtofree s6 h2 celln14 celln13)
   deleted: (on s6 h2) (clear s6) (cellspace celln14)
   added: (incell s6) (clear h2) (cellspace celln13)
   goals met: 0 of 4
15. (sendtohome h2 s4 h n2 h1 n1)
   deleted: (on h2 s4) (home h1) (clear h2)
   added: (home h2) (clear s4)
   goals met: 1 of 4
16. (sendtofree s5 s2 celln13 celln12)
   deleted: (on s5 s2) (clear s5) (cellspace celln13)
   added: (incell s5) (clear s2) (cellspace celln12)
   goals met: 1 of 4
17. (sendtohome s2 h7 s n2 s1 n1)
   deleted: (on s2 h7) (home s1) (clear s2)
   added: (home s2) (clear h7)
   goals met: 2 of 4
18. (sendtofree d4 h5 celln12 celln11)
   deleted: (on d4 h5) (clear d4) (cellspace celln12)
   added: (incell d4) (clear h5) (cellspace celln11)
   goals met: 2 of 4
19. (sendtofree h5 d1 celln11 celln10)
   deleted: (on h5 d1) (clear h5) (cellspace celln11)
   added: (incell h5) (clear d1) (cellspace celln10)
   goals met: 2 of 4
20. (sendtohome d1 c4 d n1 d0 n0)
   deleted: (on d1 c4) (home d0) (clear d1)
   added: (home d1) (clear c4)
   goals met: 2 of 4
21. (move c3 d7 h4)
   deleted: (on c3 d7) (clear h4)
   added: (on c3 h4) (clear d7)
   goals met: 2 of 4
22. (sendtofree d7 c2 celln10 celln9)
   deleted: (on d7 c2) (clear d7) (cellspace celln10)
   added: (incell d7) (clear c2) (cellspace celln9)
   goals met: 2 of 4
23. (sendtohome-b c2 c n2 c1 n1 coln0 coln1)
   deleted: (home c1) (clear c2) (bottomcol c2) (colspace coln0)
   added: (home c2) (colspace coln1)
   goals met: 3 of 4
24. (sendtofree h3 d2 celln9 celln8)
   deleted: (on h3 d2) (clear h3) (cellspace celln9)
   added: (incell h3) (clear d2) (cellspace celln8)
   goals met: 3 of 4
25. (sendtohome-b d2 d n2 d1 n1 coln1 coln2)
   deleted: (home d1) (clear d2) (bottomcol d2) (colspace coln1)
   added: (home d2) (colspace coln2)
   goals met: 4 of 4
